#include <stdio.h>

int main()
{
	int a;
	scanf("%d",&a);
	 
	if (a % 10 == 0) //个位等于0
	{
	 	if (a / 100 == 0) //百位等于0
			printf("%d\n",a / 10); //此时，该值可直接除以10得到结果
		else //满足百位不等于0，个位等于0
			printf("%d\n",a / 100 + (a - a / 100 * 100) ); //a / 100得到个位， (a - a / 100 * 100) 得到十位
	}
			
	if (a % 10 != 0) //个位不等于0
	{
	 	if (a / 100 == 0) //百位等于0
		 	printf("%d\n",a % 10 * 10 + (a - a % 10) / 10); //,a % 10 * 10得到十位，(a - a % 10) / 10得到个位
		else //满足百位不等于0，个位也不等于0
			printf("%d\n",a % 10 * 100 + (a % 100 - a % 10) + a / 100 ); //a % 10 * 100得到百位，(a % 100 - a % 10)得到十位， a / 100得到个位
	}
	
	return 0;			 			
}