#include<stdio.h>

int main()
{
    const int n = 4;
    //int A[n][n];
    //int A[4][4] = {{1, 7, 4, 1},{4, 8, 3, 6},{1, 6, 1, 2},{0, 7, 8, 9}};
    //int A[4][4] = {{7, 5, 1, 0},{5, 8, 4, 3},{9, 2, 0, 4},{6, 4, 2, 1}};  //NO
    int A[4][4] = {{1, 1, 5, 5},{4, 9, 6, 6},{5, 0, 1, 8},{2, 6, 5, 5}};  //看究竟是哪个5
   


    
    int m1,n1,max,min;
    int k;
    int flag,s=0;
    
    int i=0, j=0;
//    for ( i=0; i<n; i++ ) {
//		for ( j=0; j<n; j++ ) {
//			scanf("%d ", &A[i][j] );
//		}
//	} //读入矩阵
	
    for( i=0; i<4; i++ ) {
        max=A[i][0];//先取每行第一个数为最大值
        for( j=0 ;j<4; j++ ) {
            if( A[i][j] >= max ) { //找到该行的最大值a[m1][n1] 
				max=A[i][j]; 
                m1=i;
                n1=j;
            }
        }
        
        min=A[m1][n1];//假设每行的最大值为每列的最小值 
        flag=0;
        for( k=0; k<4; k++ ) { 
            if( A[k][n1] < min ) { //如果发现该值不是所在列的最小值，flag置1； 
            	flag = 1;
			}
                
        }
        if( flag == 0 ) { //所在列没有值比该值小，即为所在列的最小值 
            //printf("%d %d\n",m1+1, n1+1);
            printf("%d %d\n",m1, n1);
            s++; //鞍点数加1；
        } 
    }
   if( s==0 ) { //如果鞍点数为0
		printf("NO");
   }
   
   return 0;
}
//网上找的+自我修改
